<a href="https://colab.research.google.com/github/margolek/Python_sorted_by_topics/blob/main/Pandas/guipsamora/05_Merge/Housing%20Market/exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [4]:
series1 = pd.Series(np.random.randint(low=1, high=5,size=100))
series2 = pd.Series(np.random.randint(low=1, high=4,size=100))
series3 = pd.Series(np.random.randint(low=10000, high=30001,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [6]:
by_column = pd.concat([series1,series2,series3], axis=1)
by_column.head()

   0  1      2
0  2  1  10225
1  1  1  29946
2  1  1  12388
3  3  3  24231
4  4  3  10765

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [8]:
by_column.columns = ['bedrs','bathrs','price_sqr_meter']
by_column.head()

   bedrs  bathrs  price_sqr_meter
0      2       1            10225
1      1       1            29946
2      1       1            12388
3      3       3            24231
4      4       3            10765

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [11]:
bigcolumn = pd.concat([series1,series2,series3],axis=0)
print(type(bigcolumn))
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [12]:
bigcolumn.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [19]:
bigcolumn.index = pd.Series(np.arange(0,300))
bigcolumn.head()

   0
0  2
1  1
2  1
3  3
4  4